Repository: nmpetkov/Zikula-Zfiler
Catalog: modules/Zfiler/locale/*/LC_MESSAGES/module_zfiler.po
Languages: bg

source: System tools
bg: Системни инструменти

source: System tools and code execution.
bg: Системни инструменти и изпълнение на код.

source: Zfiler hooks
bg: Zfiler куки

source: Server
bg: Сървър

source: Client
bg: Клиент

source: Backup
bg: Архивиране

source: Scripts
bg: Скриптове

source: Settings
bg: Настройки

source: Wiki
bg: Помощ

source: Error! File name can not be empty.
bg: Грешка! Името на файла не може да бъде празно.

source: Error! File %s already exist.
bg: Грешка! Файл %s вече съществува.

source: Error! Can not create file %s.
bg: Грешка! Не може да се създаде файл %s.

source: Error! Can not write to file %s.
bg: Грешка! Не може да се записва във файл %s.

source: Error!
bg: Грешка!

source: Result from: %s
bg: Резултат от: %s

source: Error! File does not exist: %s
bg: Грешка! Файлът не съществува: %s

source: Error! File %s can not be deleted.
bg: Грешка! File %s не може да бъде изтрит.

source: Can not read from file %s.
bg: Не може да се чете от файл %s.

source: File does not exist: %s
bg: Файлът не съществува: %s

source: Done! Database backup is created in file %s.
bg: Готово! Архив на базата данни е създаден във файл %s.

source: Error creating database backup in file %s.
bg: Грешка при създаване на архив на базата данни във файл %s.

source: Size of created file is %s bytes.
bg: Размер на създадения файл е %s байта.

source: Create backup start time: %s.
bg: Създаване на архив начален час: %s.

source: Create backup end time: %s.
bg: Създаване на архив краен час: %s.

source: Execution time: %s seconds.
bg: Време за изпълнение: %s секунди.

source: Status:
bg: Статус

source: Error! Can not obtain connection to database.
bg: Грешка! Не може да се установи връзка с базата данни.

source: Directory exists: %s.
bg: Директорията съществува: %s.

source: Directory is created: %s.
bg: Директорията е създадена: %s.

source: Can not create directory %s.
bg: Не може да се създаде директория %s.

source: Please create it manually, for example with FTP client.
bg: Моля създайте го ръчно, например с FTP клиент.

source: Done! Updated configuration.
bg: Готово! Конфигурацията е запазена.

source: Please specify in module settings directory for scripts to execute!
bg: Моля укажете в настройките на модула в коя директория са скриптовете за изпълнение!

source: Please visit module settings and create directory for scripts to execute!
bg: Моля посетете настройките на модула и създайте директорията, в която се поставят скриптовете за изпълнение!

source: New file %s is created.
bg: Новият файл %s е създаден.

source: Done! Executed selected scripts.
bg: Готово! Избраните скриптове са изпълнени.

source: Please select scripts to execute!
bg: Моля изберете скрипт за изпълнение!

source: File %s is deleted.
bg: Файл %s е изтрит.

source: Error! File name is empty.
bg: Грешка! Името на файла е празно.

source: Error! Can not write content to file %s.
bg: Грешка! Не може да се запише съдържанието във файл %s.

source: Done! File %s is saved.
bg: Готово! Файл %s е запазен.

source: Error! File %s does not exist.
bg: Грешка! Файл %s не съществува.

source: Please specify in module settings directory for backups to store!
bg: Моля укажете в настройките на модула в коя директория ще се съхраняват архивите!

source: Please visit module settings and create directory for backups to store!
bg: Моля посетете настройките на модула и създайте директорията, в която ще се съхраняват архивите!

source: Please select a file from the list.
bg: Моля изберете файл от списъка.

source: No IP passed.
bg: Няма подадено IP.

source: Could not get info.
bg: Не може да получи информацията.

source: IP address information
bg: Информация за IP адрес

source: Close
bg: Затвори

source: Database backups
bg: Архиви на базата данни

source: To create new backup, use <Create> button below.
bg: За да създадете нов архив, използвайте бутона <Създай> отдолу.

source: Possible errors, related to your PHP host settings
bg: Възможни грешки, свързани с настройките на PHP

source: Solution is to increase `%s` PHP setting.
bg: Решението е да се увеличи '%s' в PHP настройки.

source: Current value is %s.
bg: Текущата стойност, е %s.

source: Current value is %s seconds.
bg: Текущата стойност е %s секунди.

source: Selected tables only
bg: Само избрани таблици

source: Tables to export
bg: Таблици за експортиране

source: Total
bg: Общо

source: Export method
bg: Метод за експорта

source: Compression
bg: Компресия

source: None
bg: Няма

source: Create
bg: Създай

source: Create backup
bg: Създай архив

source: Cancel
bg: Отказ

source: Backups directory
bg: Директория за архивите

source: Here is list of past database backups, available in directory:
bg: Това е списък с последните архиви на базата данни, достъпни в директория:

source: Past backups
bg: Минали архиви

source: file
bg: файл

source: files
bg: файла

source: byte
bg: байт

source: bytes
bg: байта

source: File name format
bg: Формат на името на файла

source: date
bg: дата

source: time
bg: час

source: database
bg: база данни

source: tables count-archived-total
bg: брой таблици-архивирани-общо

source: method
bg: метод

source: Download
bg: Изтегли

source: Download backup
bg: Изтегли архив

source: Delete
bg: Изтрий

source: Delete backup
bg: Изтрий архив

source: Restore
bg: Възстанови

source: Restore backup
bg: Възстанови от архив

source: Server information
bg: Информация за сървъра

source: General info
bg: Обща информация

source: Please enter URL in settings.
bg: Моля въведете URL в настройките.

source: Hosting admin panel
bg: Админ панел на хостинга

source: Open on new page
bg: Отваря на нова страница

source: System
bg: Система

source: Server IP address and port
bg: IP адрес и порт на сървъра

source: See details
bg: Виж детайли

source: Visit site
bg: Посети сайта

source: Site root directory
bg: Основна директория на сайта

source: Database info
bg: Информация за базата данни

source: Database admin panel
bg: Админ панел на базата данни

source: Database server
bg: Сървър на базата данни

source: Database driver
bg: Драйвер на базата данни

source: Database host
bg: Хост на базата данни

source: Database name
bg: Име на базата данни

source: PHP info
bg: PHP информация

source: Display PHP info in new page
bg: Покажи PHP информация на нова страница

source: Module settings
bg: Настройки на модула

source: General settings
bg: Общи настройки

source: Hosting admin URL
bg: URL за администрация на хостинга

source: Enter here URL address to your hosting provider admin panel (Cpanel or other).
bg: Въведете тук URL адреса на администраторския панел на вашия доставчик на хостинга (Cpanel или друг).

source: Link will appear in the info page for easy access.
bg: Връзката ще се появява на информационната страница за бърз достъп.

source: Database admin URL
bg: URL за администрация на базата данни

source: Enter here URL address to your database admin panel (phpMyAdmin or other).
bg: Въведете тук URL адреса на администраторския панел за базата данни (phpMyAdmin или друг).

source: Display PHP info
bg: Покажи PHP информация

source: With link in new page
bg: С препратка в нова страница

source: Always on info page
bg: Винаги на информационната страница

source: Never
bg: Никога

source: Backups
bg: Архиви

source: Default backups directory
bg: Директория по подразбиране за архивите

source: Directory exist.
bg: Директорията съществува.

source: Directory does not exist!
bg: Директорията не съществува.

source: This is the place, where database backup files are stored.
bg: Това е мястото, където се съхраняват архивните файлове на базата данни.

source: Create specified directory
bg: Създай указаната директория

source: Default export method
bg: Метод за експорт по подразбиране

source: pure php/sql code
bg: чист PHP/SQL код

source: call to mysqldump executable - fastest, but depend on server rights
bg: извиква mysqldump команда - най-бързият, но зависи от правата на сървъра

source: Mysqldump executable
bg: Mysqldump изпълним файл

source: Only for method
bg: Само за метод

source: File exist.
bg: Файлът съществува.

source: File does not exist!
bg: Файлът не съществува!

source: Ordinary path is `/usr/bin/mysqldump`, but leave empty if you are not sure, this is OK for most cases.
bg: Обикновено пътят е `/usr/bin/mysqldump`, но оставете празно, ако не сте сигурни, това е добре за повечето случаи.

source: Display export method selector
bg: Показва за избор метод за експорт

source: No
bg: Не

source: Yes
bg: Да

source: Default scripts directory
bg: Директория по подразбиране за скриптове

source: This is the place, where you upload scripts to execute.
bg: Това е мястото, където качвате скриптовете за изпълнение.

source: See example.php for sample.
bg: За пример вижте example.php.

source: Display scripts
bg: Покажи скриптовете

source: Not sorted
bg: Не сортирани

source: Alphabetical order
bg: По азбучен ред ред

source: Internal editor for scripts
bg: Вътрешен редактор за скриптове

source: Download files
bg: Изтегляне на файлове

source: Use HTTP ranges
bg: Използват се HTTP диапазони

source: This allow client (browser) to resume aborted downloads. Disable if broken files are received.
bg: Това позволява на клиента (браузъра) да възобнови прекъснати тегления. Изключете го, ако са получени счупени файлове.

source: Save
bg: Запази

source: Scripts to execute
bg: Скриптове за изпълнение

source: This module executes PHP scripts, with system core functions and classes available.
bg: Този модул изпълнява PHP скриптове, като на разположение са функциите и класовете на системата.

source: To add more scripts ready for execution, please upload them in scripts directory:
bg: За да добавите още скриптове достъпни за изпълнение, моля качете ги в директорията за скриптове.

source: You can create an empty script in the form below.
bg: Можете да създадете празен скрипт във формата по-долу.

source: Edit
bg: Редактирай

source: Are you sure you want to delete file
bg: Сигурни ли сте, че искате да изтриете файл

source: Create empty PHP file:
bg: Създай празен PHP файл:

source: Enter just file name, php extension will be forced.
bg: Напишете само името на файла, разширение на PHP ще бъде поставено.

source: Execute
bg: Изпълни

source: Security
bg: Сигурност

source: By default the system is protected from unauthorized web access. Anyway, for security reason, you can explicitly lock access to scripts directory, by creating .htaccess file in it.
bg: По подразбиране системата е защитена от неоторизиран уеб достъп. Във всеки случай, за допълнителна сигурност, изрично можете да заключите достъпа до скриптовете в директорията, чрез създаване на .htaccess файл в нея.

source: Scripts directory
bg: Директория за скриптове

source: Status
bg: Статус

source: Locked
bg: Заключена

source: Unlocked
bg: Отключена

source: Unlock
bg: Отключи

source: Lock
bg: Заключи

source: Edit script
bg: Редакция на скрипт

source: Script
bg: Скрипт

source: Save as new file
bg: Запиши като нов файл

source: If you enter here, the file will save as new with this name.
bg: Ако въведете тук, файлът ще запишете като нов с това име.

source: Save and edit
bg: Запази и редактирай

source: Save and execute
bg: Запази и изпълни

source: Execute and edit
bg: Изпълни и редактирай

source: Client information
bg: Информация за клиента

source: User IP address and port
bg: IP адрес и порт на потребителя

source: Browser info
bg: Информация за браузъра

source: User agent
bg: Потребителски агент

source: Accept language
bg: Приема език

source: Accept
bg: Приема

source: Cookies
bg: Бисквитки

source: Display on new page
bg: Показва на нова страница

source: IP address
bg: IP адрес

source: Host name
bg: Име на хост

source: City
bg: Град

source: Region
bg: Регион

source: Country
bg: Държава

source: Location
bg: Място

source: click for map
bg: кликни за карта

source: Organization
bg: Организация

source: Visit service site
bg: Посетете сайта на услугата
